HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
#include "dev_motor.h"
#include "App_Params.h"
#include "dev_pwm.h"          // PWM�豸��
#include "dev_voltage.h"      // ��ѹ�澯�¼�����
#include "dev_sensor.h"       // �����澯�¼�����
#include "device_manager.h"
#include "TickTimer.h"
#include <string.h>
#include "rtt_log.h"
#include "dev_rturn.h"          // �������У����� RTurn_LimitEvent_t
#include "Template_Pwm.h"       // PWM���ã�TMRA_4, PB6/PB7��
#include "hc32_ll_tmra.h"      // TMRA�Ĵ�������

#if MOTOR_CONTROL_MODE == 1
#include "Pwm.h"                // PWM ��������

/* PWM ȫ��ʵ������ main.c �ж��壩*/
extern pwm_t g_motor_pwm_ch1;   // PB6
extern pwm_t g_motor_pwm_ch2;   // PB7
extern pwm_t g_motor_pwm_ch3;   // PB8
extern pwm_t g_motor_pwm_ch4;   // PB9

/* PWM ģʽ��̬״̬���� */
static MotorDir_t s_eLastArbitrationDir = DIR_NONE;
static uint16_t s_u16LastTargetDuty = 0;
static bool s_bPolaritySwitchPending = false;   /* ������0�����м��� */
static uint16_t s_u16PendingTargetDuty = 0;      /* ��������Ŀ��ռ�ձ� */
static uint8_t s_u8PendingDirection = 0;          /* �������ķ���: 1=FWD 2=REV */

/* ������/��ͣʱ�䣨���룩*/
#define MOTOR_RAMP_TIME_MS      800

/* ռ�ձ����ƣ�2%-98%��*/
#define MOTOR_DUTY_MIN          2
#define MOTOR_DUTY_MAX          98

/* ռ�ձ��޷� */
static uint16_t Motor_LimitDuty(uint16_t duty) {
    if (duty < MOTOR_DUTY_MIN) return MOTOR_DUTY_MIN;
    if (duty > MOTOR_DUTY_MAX) return MOTOR_DUTY_MAX;
    return duty;
}

/* ֹͣ��PB6~PB9 ȫ 98% ����Ч */
static void Motor_SetStopDuty(void) {
    stc_tmra_pwm_init_t stcPwmInit;
    (void)TMRA_PWM_StructInit(&stcPwmInit);
    uint32_t u32Period = TMRA_GetPeriodValue(CM_TMRA_4);
    uint32_t u32Compare = (u32Period * 98U) / 100U;

    stcPwmInit.u16StartPolarity       = TMRA_PWM_HIGH;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_HIGH;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_LOW;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_HIGH;
    stcPwmInit.u32CompareValue = u32Compare;

    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH1, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH1, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH2, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH2, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH3, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH3, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH4, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH4, ENABLE);
}

/* ���м��ԣ�ȫ����Ϊ����Ч */
static void Motor_SetRunPolarity(void) {
    stc_tmra_pwm_init_t stcPwmInit;
    (void)TMRA_PWM_StructInit(&stcPwmInit);

    stcPwmInit.u16StartPolarity       = TMRA_PWM_HIGH;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_HIGH;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_LOW;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_HIGH;

    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH1, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH1, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH2, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH2, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH3, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH3, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH4, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH4, ENABLE);
}

/* ֱ������4ͨ��ռ�ձȣ�����̬��ȫ����Ч��*/
static void Motor_SetRunDutyDirect(uint16_t ch1, uint16_t ch2, uint16_t ch3, uint16_t ch4) {
    uint32_t u32Period = TMRA_GetPeriodValue(CM_TMRA_4);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH1, (u32Period * ch1) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH2, (u32Period * ch2) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH3, (u32Period * ch3) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH4, (u32Period * ch4) / 100U);
}

/* ������-��ת��CH1/2 ��ռ�ձȣ�CH3/4 ��ռ�ձ� */
static void Motor_RampForward(uint16_t target_duty) {
    uint16_t limited_duty = Motor_LimitDuty(target_duty);
    uint16_t duty_low = limited_duty;
    uint16_t duty_high = 100 - limited_duty;
    uint16_t current_duty_ch1 = PWM_GetDuty(&g_motor_pwm_ch1);

    if (current_duty_ch1 != 0) {
        /* �Ȼ�����0��������������ɺ���? Motor_Update �м����ٻ��� */
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 100 - current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 100 - current_duty_ch1, 0, 50);
        s_u16PendingTargetDuty = limited_duty;
        s_u8PendingDirection = 1;
        s_bPolaritySwitchPending = true;
        return;
    }

    /* ��ǰ��Ϊ0%��ֱ���м��Ի��� */
    Motor_SetRunPolarity();
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 0, duty_high, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 0, duty_high, MOTOR_RAMP_TIME_MS);
}

/* ������-��ת��CH1/2 ��ռ�ձȣ�CH3/4 ��ռ�ձ� */
static void Motor_RampReverse(uint16_t target_duty) {
    uint16_t limited_duty = Motor_LimitDuty(target_duty);
    uint16_t duty_low = 100 - limited_duty;
    uint16_t duty_high = limited_duty;
    uint16_t current_duty_ch1 = PWM_GetDuty(&g_motor_pwm_ch1);

    if (current_duty_ch1 != 0) {
        /* �Ȼ�����0��������������ɺ���? Motor_Update �м����ٻ��� */
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 100 - current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 100 - current_duty_ch1, 0, 50);
        s_u16PendingTargetDuty = limited_duty;
        s_u8PendingDirection = 2;
        s_bPolaritySwitchPending = true;
        return;
    }

    /* ��ǰ��Ϊ0%��ֱ���м��Ի��� */
    Motor_SetRunPolarity();
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 0, duty_high, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 0, duty_high, MOTOR_RAMP_TIME_MS);
}

/* ������ת���޻�������*/
static void Motor_RunForwardImmediate(uint16_t duty) {
    uint16_t limited_duty = Motor_LimitDuty(duty);
    uint16_t duty_low = limited_duty;
    uint16_t duty_high = 100 - limited_duty;
    Motor_SetRunPolarity();
    Motor_SetRunDutyDirect(duty_low, duty_low, duty_high, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch1, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch2, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch3, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch4, duty_high);
}

/* ������ת���޻�������*/
static void Motor_RunReverseImmediate(uint16_t duty) {
    uint16_t limited_duty = Motor_LimitDuty(duty);
    uint16_t duty_low = 100 - limited_duty;
    uint16_t duty_high = limited_duty;
    Motor_SetRunPolarity();
    Motor_SetRunDutyDirect(duty_low, duty_low, duty_high, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch1, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch2, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch3, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch4, duty_high);
}
#endif /* MOTOR_CONTROL_MODE == 1 */


// ���ļ���ͷ������ include ֮������
// ��ӡ�������?
volatile int motor_state = 0;
static uint32_t s_u32LastMotorPrintTime = 0;
#define MOTOR_PRINT_INTERVAL_MS   500

// ========== Keil Watch ����ȫ�ֱ��� ==========
// ����ٲò���Ա��� - �� Watch ����������Щ��������ʵʱ�鿴����ٲ�״�?
MotorDevice_t* volatile g_pMotor_Dev_Watch = NULL;      // ����豸ָ�루��չ���鿴���г�Ա��?
MotorDebugInfo_t volatile g_stcMotorDebug = {0};     // ������Ϣ�������ṹ����ʽ��
// Ϊ�˷���鿴���ٵ���һЩ�����ı���?
volatile uint8_t  g_u8MotorDebug_BlockFwdCount = 0;   // ��ת������������
volatile uint8_t  g_u8MotorDebug_BlockRevCount = 0;   // ��ת������������
volatile uint8_t  g_u8MotorDebug_AllowFwdCount = 0;   // ��ת������������
volatile uint8_t  g_u8MotorDebug_AllowRevCount = 0;   // ��ת������������
volatile uint8_t  g_u8MotorDebug_ActiveDeviceId = 0;  // ��ǰ��豸ID
volatile uint8_t  g_u8MotorDebug_ActiveDir = 0;       // ��ǰ�����(0=ֹͣ,1=��ת,2=��ת)
volatile uint8_t  g_u8MotorDebug_State = 0;           // ���״�?(0=IDLE,1=RAMPING,2=RUNNING)
volatile float    g_fMotorDebug_CurrentDuty = 0.0f;   // ��ǰռ�ձ�
volatile uint8_t  g_u8MotorDebug_ConflictFault = 0;   // ��ͻ���ϱ�־

// ========== �豸ID���� ==========
#define DEV_PWM_MOTOR_ID    1   // ���PWM�豸ID
#define DEV_MOTOR_ID        0   // ����豸ID���� App_Motor_Project.h �е� ID_MOTOR ����һ�£�

