HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
    if(motor->block_rev.count == 0 && motor->allow_rev.count > 0) {
        rev_cmd = &motor->allow_rev.commands[0];
    }

    // 2. ��ͻ�ж�
    MotorControlCommand_t* final = NULL;
    motor->debug_info.conflict_fault = false;

    if (fwd_cmd && rev_cmd) {
        if (fwd_cmd->device_id == rev_cmd->device_id) {
            final = NULL;
            motor->debug_info.conflict_fault = true;
        } else if (fwd_cmd->priority < rev_cmd->priority) {
            final = fwd_cmd;
        } else if (rev_cmd->priority < fwd_cmd->priority) {
            final = rev_cmd;
        } else {
            final = NULL;
        }
    } else {
        final = fwd_cmd ? fwd_cmd : rev_cmd;
    }

    // 3. ִ�о��� - ���Դ�ӡ
    if (final) {
        MOTOR_DEBUG("Arbitration: Selected %s (prio=%d), dir=%s, duty=%.1f%%\r\n",
                    (final->device_id == DEV_ID_IO_FWD) ? "IO_FWD" :
                    (final->device_id == DEV_ID_IO_REV) ? "IO_REV" :
                    (final->device_id == DEV_ID_RTURN_FWD) ? "RTURN_FWD" :
                    (final->device_id == DEV_ID_RTURN_REV) ? "RTURN_REV" :
					(final->device_id == DEV_ID_OVERCUR_FWD) ? "OVERCUR_FWD" :
                    (final->device_id == DEV_ID_CAN) ? "CAN" :
                    (final->device_id == DEV_ID_POWER_POS) ? "POWER_POS" :
                    (final->device_id == DEV_ID_POWER_NEG) ? "POWER_NEG" : "UNKNOWN",
                    final->priority,
                    (final->type == CMD_TYPE_RUN_FWD || final->type == CMD_TYPE_RAMP_FWD) ? "FWD" : "REV",
                    final->param);
        
        motor->active_device_id = final->device_id;
        motor->active_dir = (final->type == CMD_TYPE_RUN_FWD || final->type == CMD_TYPE_RAMP_FWD) ? DIR_FWD : DIR_REV;
        motor->last_sent_duty = final->param;
        motor->state = (final->type == CMD_TYPE_RAMP_FWD || final->type == CMD_TYPE_RAMP_REV) ? MS_RAMPING : MS_RUNNING;

        // �����ٲý���ص�?
        if (motor->active_dir == DIR_FWD) {
            Motor_OnArbitrationFwd(motor, motor->last_sent_duty);
        } else {
            Motor_OnArbitrationRev(motor, motor->last_sent_duty);
        }

        // ����PWM�豸����
        DeviceCommandData_t cmd_data;
        PWM_RampCmd_t ramp_cmd;

        if (final->type == CMD_TYPE_RAMP_FWD || final->type == CMD_TYPE_RAMP_REV) {
            cmd_data.cmd = CMD_PWM_SET_DUTY_SLOW;
            ramp_cmd.targetDuty = (uint16_t)(final->param);
            ramp_cmd.rampTimeMs = 2000;  // 2�뻺����
            cmd_data.params = &ramp_cmd;
            cmd_data.param_size = sizeof(PWM_RampCmd_t);
        } else {
            cmd_data.cmd = CMD_PWM_SET_DUTY;
            cmd_data.params = &final->param;
            cmd_data.param_size = sizeof(uint16_t);
        }
        Device_Control(DEV_PWM_MOTOR_ID, &cmd_data);
    } else {
        MOTOR_DEBUG("Arbitration: No command selected - STOP\r\n");
        
        motor->last_sent_duty = 0.0f;
        motor->state = MS_IDLE;
        motor->active_dir = DIR_NONE;
        motor->active_device_id = DEV_ID_NONE;

        // �����ٲ�ֹͣ�ص�
        Motor_OnArbitrationStop(motor);

        // ֹͣPWM
        DeviceCommandData_t cmd_data;
        cmd_data.cmd = CMD_PWM_STOP;
        cmd_data.params = NULL;
        Device_Control(DEV_PWM_MOTOR_ID, &cmd_data);
    }

    Motor_UpdateDebugInfo(motor);
}

// ========== EventBus�ص����� ==========

void Motor_OnOvercurrent(void* payload) {
    MotorOvercurrentEvent_t* ev = (MotorOvercurrentEvent_t*)payload;
    MAIN_D("Motor: Overcurrent event! ADC=%d, Current=%d mA, Threshold=%d mA, Duration=%lu ms\r\n",
           ev->adc_id, ev->current_ma, ev->threshold_ma, ev->duration_ms);

    // ִ�н���ֹͣ
    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (node && node->private_data) {
        MotorDevice_t* motor = (MotorDevice_t*)node->private_data;
        Motor_EmergencyStop(motor);
        MAIN_D("Motor: Emergency stop due to overcurrent!\r\n");
    }
}

// ========== ��ѹ�澯�ص� ==========
void Motor_OnVoltageAlarm(void* payload) {
    Voltage_AlarmEvent_t* ev = (Voltage_AlarmEvent_t*)payload;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    if (ev->u8IsActive) {
        // �澯���� - ���ݸ澯����ʹ�ö�Ӧ���豸ID�� block_fwd/block_rev ��������ָ��
        // ʹ�� PRIO_LIMIT ���ȼ�������λ����ͬ����ȷ�������豸�޷�����
        MotorDeviceId_t dev_id_fwd, dev_id_rev;
        const char* alarm_name;

        if (ev->u8AlarmType == VOLTAGE_ALARM_OVERVOLTAGE) {
            dev_id_fwd = DEV_ID_OVERVOLTAGE_FWD;
            dev_id_rev = DEV_ID_OVERVOLTAGE_REV;
            alarm_name = "OVERVOLTAGE";
        } else {
            dev_id_fwd = DEV_ID_UNDERVOLTAGE_FWD;
            dev_id_rev = DEV_ID_UNDERVOLTAGE_REV;
            alarm_name = "UNDERVOLTAGE";
        }

        MotorControlCommand_t block_fwd_cmd = {
            .device_id = dev_id_fwd,
            .priority = PRIO_LIMIT,
            .type = CMD_TYPE_BLOCK_FWD,
            .timestamp = tickTimer_GetCount()
        };
        // Motor_CmdList_SetBlock(&motor->block_fwd, block_fwd_cmd);

        MotorControlCommand_t block_rev_cmd = {
            .device_id = dev_id_rev,
            .priority = PRIO_LIMIT,
            .type = CMD_TYPE_BLOCK_REV,
            .timestamp = tickTimer_GetCount()
        };
        // Motor_CmdList_SetBlock(&motor->block_rev, block_rev_cmd);

        MAIN_D("Motor: %s alarm! Bus=%lu mV, Threshold=%lu mV - Block both directions!\r\n",
               alarm_name, ev->u32BusVoltageMv, ev->u32ThresholdMv);
    } else {
        // �澯���? - ���ݸ澯����ʹ�ö�Ӧ���豸ID�� block_fwd/block_rev �Ƴ�����ָ��
        MotorDeviceId_t dev_id_fwd, dev_id_rev;
        const char* alarm_name;

        if (ev->u8AlarmType == VOLTAGE_ALARM_OVERVOLTAGE) {
            dev_id_fwd = DEV_ID_OVERVOLTAGE_FWD;
            dev_id_rev = DEV_ID_OVERVOLTAGE_REV;
            alarm_name = "OVERVOLTAGE";
        } else {
            dev_id_fwd = DEV_ID_UNDERVOLTAGE_FWD;
            dev_id_rev = DEV_ID_UNDERVOLTAGE_REV;
            alarm_name = "UNDERVOLTAGE";
        }

