HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
        Motor_CmdList_Remove(&motor->block_fwd, dev_id_fwd);
        Motor_CmdList_Remove(&motor->block_rev, dev_id_rev);

        MAIN_D("Motor: %s released! Bus=%lu mV - Unblock both directions\r\n",
               alarm_name, ev->u32BusVoltageMv);
    }

    Motor_ArbitrationDecision(motor);
}

void Motor_OnRTurnLimit(void* payload) {
    RTurn_LimitEvent_t* ev = (RTurn_LimitEvent_t*)payload;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    if (ev->u8IsActive) {
        // ��λ���������� BLOCK ָ�ʹ�� RTurn ר���豸ID��
        MotorControlCommand_t cmd = {
            .device_id = (ev->u8Direction == RTURN_LIMIT_FORWARD) ? DEV_ID_RTURN_FWD : DEV_ID_RTURN_REV,
            .priority = PRIO_LIMIT,
            .timestamp = tickTimer_GetCount()
        };

        if (ev->u8Direction == RTURN_LIMIT_FORWARD) {
            cmd.type = CMD_TYPE_BLOCK_FWD;
            Motor_CmdList_SetBlock(&motor->block_fwd, cmd);
            // ͬʱ���? allow_fwd��ȷ����ʹ block ���Ƴ������Ҳ���������ת
            Motor_ClearAllowFwd(motor);
            MAIN_D("Motor: RTurn forward limit triggered, block forward + clear allow_fwd\r\n");
        } else {
            cmd.type = CMD_TYPE_BLOCK_REV;
            Motor_CmdList_SetBlock(&motor->block_rev, cmd);
            // ͬʱ���? allow_rev��ȷ����ʹ block ���Ƴ������Ҳ���������ת
            Motor_ClearAllowRev(motor);
            MAIN_D("Motor: RTurn reverse limit triggered, block reverse + clear allow_rev\r\n");
        }
    } else {
        // ��λ������Ƴ�? BLOCK ָ�ʹ�� RTurn ר���豸ID��
        MotorDeviceId_t id = (ev->u8Direction == RTURN_LIMIT_FORWARD) ? DEV_ID_RTURN_FWD : DEV_ID_RTURN_REV;
        if (ev->u8Direction == RTURN_LIMIT_FORWARD) {
            Motor_CmdList_Remove(&motor->block_fwd, id);
            MAIN_D("Motor: RTurn forward limit released\r\n");
        } else if (ev->u8Direction == RTURN_LIMIT_REVERSE) {
            Motor_CmdList_Remove(&motor->block_rev, id);
            MAIN_D("Motor: RTurn reverse limit released\r\n");
        } else {
            // ����Ϊ0ʱ������������?
            Motor_CmdList_Remove(&motor->block_fwd, DEV_ID_RTURN_FWD);
            Motor_CmdList_Remove(&motor->block_rev, DEV_ID_RTURN_REV);
        }
    }

    Motor_ArbitrationDecision(motor);
}

// ========== �����澯�ص� ==========
void Motor_OnCurrentAlarm(void* payload) {
    Current_AlarmEvent_t* ev = (Current_AlarmEvent_t*)payload;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    if (ev->u8IsActive) {
        /* �жϵ�ǰ������򣺽���תʱ�������������?
         * ��ת��ת����Ԥ�ڹ������緧�Źرյ�λ������������ת */
        MotorDir_t eDesiredDir = Motor_GetDesiredDirection(motor);
        
        if (eDesiredDir == DIR_FWD)
        {
            // ��תʱ���� �� �� block_fwd ���� DEV_ID_OVERCUR_FWD ����ָ��
            MotorControlCommand_t block_fwd_cmd = {
                .device_id = DEV_ID_OVERCUR_FWD,
                .priority = PRIO_LIMIT,
                .type = CMD_TYPE_BLOCK_FWD,
                .timestamp = tickTimer_GetCount()
            };
            Motor_CmdList_SetBlock(&motor->block_fwd, block_fwd_cmd);

            MAIN_D("Motor: OVERCURRENT alarm (FWD)! Current=%ld mA, Threshold=%ld mA - Block forward!\r\n",
                   (long)ev->s32CurrentMa, (long)ev->s32ThresholdMa);
        }
        else
        {
            // ��ת��ֹͣʱ���� �� ��������ת����ת��ת����Ԥ�ڹ�����
            MAIN_D("Motor: OVERCURRENT alarm (dir=%d, REV/STOP is normal stall)! Current=%ld mA, Threshold=%ld mA - Skip block forward\r\n",
                   (int)eDesiredDir, (long)ev->s32CurrentMa, (long)ev->s32ThresholdMa);
        }
    } else {
        // �����澯���? - �� block_fwd �Ƴ� DEV_ID_OVERCUR_FWD
        Motor_CmdList_Remove(&motor->block_fwd, DEV_ID_OVERCUR_FWD);

        MAIN_D("Motor: OVERCURRENT released! Current=%ld mA - Unblock forward\r\n",
               (long)ev->s32CurrentMa);
    }

    Motor_ArbitrationDecision(motor);
}


// ========== 正转(开�?)过流回调 ==========
void Motor_OnOvercurrentFwd(void* payload) {
    Current_AlarmEvent_t* ev = (Current_AlarmEvent_t*)payload;
    if (!ev) return;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;
    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    if (ev->u8IsActive) {
        MotorControlCommand_t block_cmd = {
            .device_id = DEV_ID_OVERCUR_FWD,
            .priority = PRIO_LIMIT,
            .type = CMD_TYPE_BLOCK_FWD,
            .timestamp = tickTimer_GetCount()
        };
        Motor_CmdList_SetBlock(&motor->block_fwd, block_cmd);
        MAIN_D("Motor: OVERCURRENT FWD alarm! Current=%ld mA, Threshold=%ld mA - Block forward!\r\n",
               (long)ev->s32CurrentMa, (long)ev->s32ThresholdMa);
    } else {
        Motor_CmdList_Remove(&motor->block_fwd, DEV_ID_OVERCUR_FWD);
        MAIN_D("Motor: OVERCURRENT FWD released! Current=%ld mA - Unblock forward\r\n",
               (long)ev->s32CurrentMa);
    }

    Motor_ArbitrationDecision(motor);
}


// ========== 反转(关窗)过流回调 ==========
void Motor_OnOvercurrentRev(void* payload) {
    Current_AlarmEvent_t* ev = (Current_AlarmEvent_t*)payload;
    if (!ev) return;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;
    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    if (ev->u8IsActive) {
        MotorControlCommand_t block_cmd = {
            .device_id = DEV_ID_OVERCUR_REV,
            .priority = PRIO_LIMIT,
            .type = CMD_TYPE_BLOCK_REV,
            .timestamp = tickTimer_GetCount()
        };
        Motor_CmdList_SetBlock(&motor->block_rev, block_cmd);
        MAIN_D("Motor: OVERCURRENT REV alarm! Current=%ld mA, Threshold=%ld mA - Block reverse!\r\n",
               (long)ev->s32CurrentMa, (long)ev->s32ThresholdMa);
    } else {
        Motor_CmdList_Remove(&motor->block_rev, DEV_ID_OVERCUR_REV);
        MAIN_D("Motor: OVERCURRENT REV released! Current=%ld mA - Unblock reverse\r\n",
               (long)ev->s32CurrentMa);
    }

