HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
    Motor_ArbitrationDecision(motor);
}


void Motor_OnHardLimit(void* payload) {
    MotorLimitEvent_t* ev = (MotorLimitEvent_t*)payload;
    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    MotorDeviceId_t id = (ev->dir == DIR_FWD) ? DEV_ID_LIMIT_FWD : DEV_ID_LIMIT_REV;

    if (ev->is_active) {
        MotorControlCommand_t cmd = {
            .device_id = id,
            .timestamp = tickTimer_GetCount()
        };

        if (ev->dir == DIR_FWD) {
            cmd.type = CMD_TYPE_BLOCK_FWD;
            Motor_CmdList_SetBlock(&motor->block_fwd, cmd);
        } else {
            cmd.type = CMD_TYPE_BLOCK_REV;
            Motor_CmdList_SetBlock(&motor->block_rev, cmd);
        }
    } else {
        if (ev->dir == DIR_FWD) {
            Motor_CmdList_Remove(&motor->block_fwd, id);
        } else {
            Motor_CmdList_Remove(&motor->block_rev, id);
        }
    }

    Motor_ArbitrationDecision(motor);
}

void Motor_OnPowerEvent(void* payload) {
    MotorPowerEvent_t* ev = (MotorPowerEvent_t*)payload;
    MAIN_D("[MOTOR] OnPowerEvent: power_id=%d, is_on=%d\r\n", ev->power_id, ev->is_on);

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

#if MOTOR_MODE_BIPOLAR
    // ========== ˫����ģʽ ==========
    // ��Դ�豸�ṩ ALLOW ���Ƶ��ת�򣬲�����? BLOCK
    MotorDeviceId_t id = (ev->power_id == 0) ? DEV_ID_POWER_POS : DEV_ID_POWER_NEG;
    const MotorDeviceGene_t* gene = Motor_GetGene(id);
    if (!gene) return;

    MotorControlCommand_t cmd = {
        .device_id = id,
        .priority = gene->priority,
        .param = 85.0f,
        .timestamp = tickTimer_GetCount()
    };

    if (ev->is_on) {
        if (id == DEV_ID_POWER_POS) {
            cmd.type = CMD_TYPE_RUN_FWD;
            Motor_CmdList_SetAllow(&motor->allow_fwd, &motor->block_fwd, cmd);
            MAIN_D("[MOTOR] Bipolar: POWER_POS ON, added allow_fwd\r\n");
        } else {
            cmd.type = CMD_TYPE_RUN_REV;
            Motor_CmdList_SetAllow(&motor->allow_rev, &motor->block_rev, cmd);
            MAIN_D("[MOTOR] Bipolar: POWER_NEG ON, added allow_rev\r\n");
        }
    } else {
        if (id == DEV_ID_POWER_POS) {
            Motor_CmdList_Remove(&motor->allow_fwd, id);
            MAIN_D("[MOTOR] Bipolar: POWER_POS OFF, removed allow_fwd\r\n");
        } else {
            Motor_CmdList_Remove(&motor->allow_rev, id);
            MAIN_D("[MOTOR] Bipolar: POWER_NEG OFF, removed allow_rev\r\n");
        }
    }
#else
    // ========== ������ģʽ ==========
    // ������ģʽ�µ�Դ�豸�������ٲã������κβ���
    // �����豸�����ֶ�IO���ṩĳת���ALLOW����ת
    MAIN_D("[MOTOR] Unipolar mode: power_id=%d, is_on=%d - power device not involved in arbitration\r\n",
           ev->power_id, ev->is_on);
#endif

    Motor_ArbitrationDecision(motor);
}

void Motor_OnManualIO(void* payload) {
    MotorManualIOEvent_t* ev = (MotorManualIOEvent_t*)payload;
    
    // �ȼ���¼����ݵ���Ч��?
    if (ev == NULL) {
        MAIN_D("[MOTOR] OnManualIO: NULL payload!\r\n");
        return;
    }
    
    // ��ӡԭʼ�¼����ݣ�ʹ��ʮ�����ƴ�ӡ��������
    uint32_t speed_raw = *(uint32_t*)&ev->speed;
    MAIN_D("[MOTOR] OnManualIO RAW: dir=%d, type=%d, speed_raw=0x%08X\r\n", 
           ev->dir, ev->type, speed_raw);
    
    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) {
        MAIN_D("[MOTOR] OnManualIO: Device not found!\r\n");
        return;
    }

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    // ���ݷ���ȷ�����ĸ�IO�豸 - �����ʼ��Ĭ��ֵ��?
    MotorDeviceId_t io_dev_id = DEV_ID_NONE;  // ��ʼ��Ϊ NONE
    
    if (ev->dir == DIR_FWD) {
        io_dev_id = DEV_ID_IO_FWD;
    } else if (ev->dir == DIR_REV) {
        io_dev_id = DEV_ID_IO_REV;
    } else if (ev->dir == DIR_NONE) {
        io_dev_id = DEV_ID_NONE;
    } else {
        // ��Ч�� dir ֵ
        MAIN_D("[MOTOR] OnManualIO: Invalid dir=%d, expected 0,1,2\r\n", ev->dir);
        return;
    }

    const MotorDeviceGene_t* gene = NULL;
    if (io_dev_id != DEV_ID_NONE) {
        gene = Motor_GetGene(io_dev_id);
        if (!gene) {
            MAIN_D("[MOTOR] OnManualIO: gene not found for dev_id=%d!\r\n", io_dev_id);
            return;
        }
    }
    
    // ��ӡ������Ϣ - ������ת��Ϊ����
    int32_t speed_int = (int32_t)(ev->speed * 10);
    MAIN_D("[MOTOR] OnManualIO: dir=%d, type=%d, speed=%ld.%ld%%, io_dev_id=%d\r\n",
           ev->dir, ev->type, (long)(speed_int / 10), (long)(speed_int % 10), io_dev_id);
    MAIN_D("[MOTOR] OnManualIO: Before - allow_fwd.count=%d, allow_rev.count=%d, block_fwd.count=%d, block_rev.count=%d\r\n",
           motor->allow_fwd.count, motor->allow_rev.count, motor->block_fwd.count, motor->block_rev.count);

    // ��������ָ��
    if (ev->type == CMD_TYPE_RUN_FWD || ev->type == CMD_TYPE_RAMP_FWD) {
        // ���? io_dev_id �Ƿ���ȷ
        if (io_dev_id != DEV_ID_IO_FWD) {
            MAIN_D("[MOTOR] ERROR: RUN_FWD but io_dev_id=%d (expected %d)\r\n", io_dev_id, DEV_ID_IO_FWD);
            return;
        }
        
        // IO_FWD���£��Ƴ��Լ���BLOCK�������Լ���ALLOW
        MotorControlCommand_t cmd = {
            .device_id = io_dev_id,
            .priority = gene->priority,
            .type = ev->type,
            .param = ev->speed,
            .timestamp = tickTimer_GetCount()
        };

        Motor_CmdList_Remove(&motor->block_fwd, io_dev_id);
        Motor_CmdList_SetAllow(&motor->allow_fwd, &motor->block_fwd, cmd);
        
        MAIN_D("[MOTOR] IO_FWD: RUN, removed block_fwd, added allow_fwd\r\n");
    }
    else if (ev->type == CMD_TYPE_RUN_REV || ev->type == CMD_TYPE_RAMP_REV) {
        // ���? io_dev_id �Ƿ���ȷ
        if (io_dev_id != DEV_ID_IO_REV) {
            MAIN_D("[MOTOR] ERROR: RUN_REV but io_dev_id=%d (expected %d)\r\n", io_dev_id, DEV_ID_IO_REV);
            return;
        }
        
        // IO_REV���£��Ƴ��Լ���BLOCK�������Լ���ALLOW
        MotorControlCommand_t cmd = {
            .device_id = io_dev_id,
            .priority = gene->priority,
            .type = ev->type,
            .param = ev->speed,
            .timestamp = tickTimer_GetCount()
        };

        Motor_CmdList_Remove(&motor->block_rev, io_dev_id);
        Motor_CmdList_SetAllow(&motor->allow_rev, &motor->block_rev, cmd);
        
