HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
        MAIN_D("[MOTOR] IO_REV: RUN, removed block_rev, added allow_rev\r\n");
    }
    else if (ev->type == CMD_TYPE_STOP) {
        if (ev->dir == DIR_FWD) {
            // IO_FWDֹͣ���Ƴ��Լ���ALLOW�������Լ���BLOCK
            if (gene == NULL) {
                gene = Motor_GetGene(DEV_ID_IO_FWD);
                if (!gene) {
                    MAIN_D("[MOTOR] OnManualIO: gene not found for IO_FWD!\r\n");
                    return;
                }
            }
            
            Motor_CmdList_Remove(&motor->allow_fwd, DEV_ID_IO_FWD);
            
            MotorControlCommand_t block_cmd = {
                .device_id = DEV_ID_IO_FWD,
                .priority = gene->priority,
                .type = CMD_TYPE_BLOCK_FWD,
                .timestamp = tickTimer_GetCount()
            };
            // Motor_CmdList_SetBlock(&motor->block_fwd, block_cmd);
            
            MAIN_D("[MOTOR] IO_FWD: STOP, removed allow_fwd, added block_fwd\r\n");
        }
        else if (ev->dir == DIR_REV) {
            // IO_REVֹͣ���Ƴ��Լ���ALLOW�������Լ���BLOCK
            if (gene == NULL) {
                gene = Motor_GetGene(DEV_ID_IO_REV);
                if (!gene) {
                    MAIN_D("[MOTOR] OnManualIO: gene not found for IO_REV!\r\n");
                    return;
                }
            }
            
            Motor_CmdList_Remove(&motor->allow_rev, DEV_ID_IO_REV);
            
            MotorControlCommand_t block_cmd = {
                .device_id = DEV_ID_IO_REV,
                .priority = gene->priority,
                .type = CMD_TYPE_BLOCK_REV,
                .timestamp = tickTimer_GetCount()
            };
            // Motor_CmdList_SetBlock(&motor->block_rev, block_cmd);
            
            MAIN_D("[MOTOR] IO_REV: STOP, removed allow_rev, added block_rev\r\n");
        }
        else {
            // ֹͣ����IO�豸���Ƴ����Ե�ALLOW�����Ӹ��Ե�BLOCK
            const MotorDeviceGene_t* gene_fwd = Motor_GetGene(DEV_ID_IO_FWD);
            const MotorDeviceGene_t* gene_rev = Motor_GetGene(DEV_ID_IO_REV);
            
            Motor_CmdList_Remove(&motor->allow_fwd, DEV_ID_IO_FWD);
            Motor_CmdList_Remove(&motor->allow_rev, DEV_ID_IO_REV);
            
            if (gene_fwd) {
                MotorControlCommand_t block_fwd_cmd = {
                    .device_id = DEV_ID_IO_FWD,
                    .priority = gene_fwd->priority,
                    .type = CMD_TYPE_BLOCK_FWD,
                    .timestamp = tickTimer_GetCount()
                };
                // Motor_CmdList_SetBlock(&motor->block_fwd, block_fwd_cmd);
            }
            
            if (gene_rev) {
                MotorControlCommand_t block_rev_cmd = {
                    .device_id = DEV_ID_IO_REV,
                    .priority = gene_rev->priority,
                    .type = CMD_TYPE_BLOCK_REV,
                    .timestamp = tickTimer_GetCount()
                };
                // Motor_CmdList_SetBlock(&motor->block_rev, block_rev_cmd);
            }
            
            MAIN_D("[MOTOR] All IO: STOP, removed all allow, added all block\r\n");
        }
    }
    else {
        MAIN_D("[MOTOR] OnManualIO: Unknown type=%d\r\n", ev->type);
        return;
    }

    Motor_ArbitrationDecision(motor);
}

void Motor_OnCANEvent(void* payload) {
    // CAN�¼���������ʱ�����ӿڣ�δʵ�֣�
    // MotorCANEvent_t* ev = (MotorCANEvent_t*)payload;
    (void)payload;  // ����δʹ�þ���
}

// ========== �������������ת�ٷ����ص�? ==========
void Motor_OnSpeedFeedback(void* payload) {
    int32_t* speed_rpm = (int32_t*)payload;

    DeviceNode_t* node = DeviceManager_Get(DEV_MOTOR_ID);
    if (!node || !node->private_data) return;

    MotorDevice_t* motor = (MotorDevice_t*)node->private_data;

    // ��ѡ������ת�ٽ��бջ�����
    // ���磺����Ŀ��ת�ٵ���ռ�ձ�
    if (motor->state == MS_RUNNING || motor->state == MS_RAMPING) {
        // ����������ʵ�� PID ����
        // Ŀǰֻ�ǽ���ת�����ݣ������Ի������չʹ��?
        (void)motor;      // ����δʹ�þ���
        (void)speed_rpm;  // ����δʹ�þ���
    }
}

// ========== ��׼�豸�����ӿ�ʵ�� ==========

DeviceResult_t Motor_Init(void* handle) {
    MotorDevice_t* motor = (MotorDevice_t*)handle;
    if (!motor) return RESULT_PARAM_ERR;

    memset(motor, 0, sizeof(MotorDevice_t));

    // ��ʼ�������б�
    for(int i = 0; i < MAX_COMMANDS_PER_DIRECTION; i++) {
        motor->allow_fwd.commands[i].device_id = DEV_ID_NONE;
        motor->allow_fwd.commands[i].priority = PRIO_NONE;
        motor->allow_rev.commands[i].device_id = DEV_ID_NONE;
        motor->allow_rev.commands[i].priority = PRIO_NONE;
        motor->block_fwd.commands[i].device_id = DEV_ID_NONE;
        motor->block_rev.commands[i].device_id = DEV_ID_NONE;
    }

    // ��ʼ��IO�豸Ĭ��״̬��ÿ��IO�豸Ĭ��BLOCK�Լ��ķ���
    // IO_FWDĬ��BLOCK��ת��IO_REVĬ��BLOCK��ת
    MotorControlCommand_t io_fwd_block = {
        .device_id = DEV_ID_IO_FWD,
        .priority = MANUAL_PRIORITY,
        .type = CMD_TYPE_BLOCK_FWD,
        .timestamp = tickTimer_GetCount()
    };
    // Motor_CmdList_SetBlock(&motor->block_fwd, io_fwd_block);
    
    MotorControlCommand_t io_rev_block = {
        .device_id = DEV_ID_IO_REV,
        .priority = MANUAL_PRIORITY,
        .type = CMD_TYPE_BLOCK_REV,
        .timestamp = tickTimer_GetCount()
    };
    // Motor_CmdList_SetBlock(&motor->block_rev, io_rev_block);

    motor->enable = 1;
    motor->last_arbitration_time = tickTimer_GetCount();

    // ���õ���ȫ��ָ��
    g_pMotor_Dev_Watch = motor;
    
    // ��ʼ�����Ա���
    Motor_UpdateDebugInfo(motor);

    // ����EventBus�¼�
    // ע�⣺����ͳһ�� App_Motor_Project.c �� SetupEventBusSubscriptions() �й���
    // ���ﲻ���ظ����ģ�����ص������ע��
    

#if MOTOR_CONTROL_MODE == 1
    s_eLastArbitrationDir = DIR_NONE;
    s_u16LastTargetDuty = 0;

    // ͬ������PWM״̬��Ӳ���Ĵ���
    uint32_t period = TMRA_GetPeriodValue(CM_TMRA_4);
    if (period > 0) {
        uint32_t cmp1 = TMRA_GetCompareValue(CM_TMRA_4, TMRA_CH1);
        uint32_t cmp2 = TMRA_GetCompareValue(CM_TMRA_4, TMRA_CH2);
        uint32_t cmp3 = TMRA_GetCompareValue(CM_TMRA_4, TMRA_CH3);
        uint32_t cmp4 = TMRA_GetCompareValue(CM_TMRA_4, TMRA_CH4);
        g_motor_pwm_ch1.dutyPercent = (uint16_t)((cmp1 * 100) / period);
        g_motor_pwm_ch2.dutyPercent = (uint16_t)((cmp2 * 100) / period);
        g_motor_pwm_ch3.dutyPercent = (uint16_t)((cmp3 * 100) / period);
        g_motor_pwm_ch4.dutyPercent = (uint16_t)((cmp4 * 100) / period);
    }
#endif

    MOTOR_DEBUG("Motor_Init completed, g_pMotor_Dev_Watch set\r\n");
    return RESULT_OK;
}

DeviceResult_t Motor_Deinit(void* handle) {
    MotorDevice_t* motor = (MotorDevice_t*)handle;
    if (!motor) return RESULT_PARAM_ERR;

    motor->enable = 0;
    Motor_EmergencyStop(motor);
    
